# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.

string_a = input('Введите первую строку: ')
string_b = input('Введите вторую строку: ')
print (string_b.count(string_b))

# count = 0
# for i in string_a